Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/bluetooth/ble_shell/shell_gap.c
/*! *********************************************************************************
 * \addtogroup SHELL GAP
 * @{
 ********************************************************************************** */
/*!
* The Clear BSD License
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2017 NXP
* All rights reserved.
* 
* \file
*
* This file is the source file for the GAP Shell module
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted (subject to the limitations in the
* disclaimer below) provided that the following conditions are met:
* 
* * Redistributions of source code must retain the above copyright
*   notice, this list of conditions and the following disclaimer.
* 
* * Redistributions in binary form must reproduce the above copyright
*   notice, this list of conditions and the following disclaimer in the
*   documentation and/or other materials provided with the distribution.
* 
* * Neither the name of the copyright holder nor the names of its
*   contributors may be used to endorse or promote products derived from
*   this software without specific prior written permission.
* 
* NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE
* GRANTED BY THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT
* HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED
* WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
* MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
* BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
* WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
* OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
* IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

/************************************************************************************
 *************************************************************************************
 * Include
 *************************************************************************************
 ************************************************************************************/
/* Framework / Drivers */
#include "TimersManager.h"
#include "FunctionLib.h"
#include "fsl_os_abstraction.h"
#include "shell.h"
#include "Panic.h"
#include "MemManager.h"
#include "board.h"

/* BLE Host Stack */
#include "ble_shell.h"
#include "gatt_interface.h"
#include "gatt_server_interface.h"
#include "gatt_client_interface.h"
#include "gatt_db_app_interface.h"
#include "gap_interface.h"
#include "l2ca_interface.h"

#include "shell_gattdb.h"
#include "ApplMain.h"
#include "shell_gap.h"

#include <string.h>
#include <stdlib.h>
/************************************************************************************
*************************************************************************************
* Private macros
*************************************************************************************
************************************************************************************/
#define mShellGapCmdsCount_c                20
#define mShellGapMaxScannedDevicesCount_c   5
#define mShellGapMaxDeviceNameLength_c      20
/************************************************************************************
*************************************************************************************
* Private type definitions
*************************************************************************************
************************************************************************************/
typedef struct gapCmds_tag
{
    char*       name;
    int8_t      (*cmd)(uint8_t argc, char * argv[]); 
}gapCmds_t;

typedef struct gapScannedDevices_tag
{
    bleAddressType_t    addrType;
    bleDeviceAddress_t  aAddress;
    uchar_t             name[10];
}gapScannedDevices_t;

/************************************************************************************
*************************************************************************************
* Private functions prototypes
*************************************************************************************
************************************************************************************/

/* Shell GAP Events Callback */
static void ShellGap_AdvertisingCallback
(
    gapAdvertisingEvent_t* pAdvertisingEvent
);

static void ShellGap_ScanningCallback
(
    gapScanningEvent_t* pScanningEvent
);

static void ShellGap_ConnectionCallback
(
    deviceId_t peerDeviceId,
    gapConnectionEvent_t* pConnectionEvent
);

/* Shell API Functions */
static int8_t ShellGap_DeviceAddress(uint8_t argc, char * argv[]);
static int8_t ShellGap_DeviceName(uint8_t argc, char * argv[]);

static int8_t ShellGap_StartAdvertising(uint8_t argc, char * argv[]);
static int8_t ShellGap_StopAdvertising(uint8_t argc, char * argv[]);
static int8_t ShellGap_SetAdvertisingParameters(uint8_t argc, char * argv[]);
static int8_t ShellGap_ChangeAdvertisingData(uint8_t argc, char * argv[]);

static int8_t ShellGap_StartScanning(uint8_t argc, char * argv[]);
static int8_t ShellGap_StopScanning(uint8_t argc, char * argv[]);
static int8_t ShellGap_SetScanParameters(uint8_t argc, char * argv[]);
static int8_t ShellGap_ChangeScanData(uint8_t argc, char * argv[]);

static int8_t ShellGap_Connect(uint8_t argc, char * argv[]);
static int8_t ShellGap_SetConnectionParameters(uint8_t argc, char * argv[]);
static int8_t ShellGap_Disconnect(uint8_t argc, char * argv[]);
static int8_t ShellGap_UpdateConnection(uint8_t argc, char * argv[]);

static int8_t ShellGap_Pair(uint8_t argc, char * argv[]);
static int8_t ShellGap_PairCfg(uint8_t argc, char * argv[]);
static int8_t ShellGap_EnterPasskey(uint8_t argc, char * argv[]);
static int8_t ShellGap_Bonds(uint8_t argc, char * argv[]);
/************************************************************************************
*************************************************************************************
* Private memory declarations
*************************************************************************************
************************************************************************************/
const gapCmds_t mGapShellCmds[mShellGapCmdsCount_c] = 
{
    {"address",     ShellGap_DeviceAddress},
    {"devicename",  ShellGap_DeviceName},
    
    {"advstart",    ShellGap_StartAdvertising},
    {"advstop",     ShellGap_StopAdvertising},
    {"advcfg",      ShellGap_SetAdvertisingParameters},
    {"advdata",     ShellGap_ChangeAdvertisingData},

