Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/bluetooth/ble_shell/shell_gap.c
    {"scanstart",   ShellGap_StartScanning},
    {"scanstop",    ShellGap_StopScanning},
    {"scancfg",     ShellGap_SetScanParameters},
    {"scandata",    ShellGap_ChangeScanData},

    {"connect",     ShellGap_Connect},
    {"connectcfg",  ShellGap_SetConnectionParameters},
    {"disconnect",  ShellGap_Disconnect},
    {"connupdate",  ShellGap_UpdateConnection},

    {"pair",        ShellGap_Pair},
    {"paircfg",     ShellGap_PairCfg},
    {"enterpin",    ShellGap_EnterPasskey},
    {"bonds",       ShellGap_Bonds},
    
};

static bool_t mAdvOn = FALSE;
static bool_t mIsBonded = FALSE;
static bool_t mScanningOn = FALSE;

static bool_t mIsMaster = FALSE;

static gapScannedDevices_t     mScannedDevices[mShellGapMaxScannedDevicesCount_c];
static uint8_t                 mScannedDevicesCount;
static uint8_t                 mConnectToDeviceId = mShellGapMaxScannedDevicesCount_c;

static gapConnectionParameters_t mConnectionParams;

/* Pointer to ADV data */
static uint8_t  *mpAdvData = NULL;
static uint8_t  *mpScanRspData = NULL;
/************************************************************************************
*************************************************************************************
* Public memory declarations
*************************************************************************************
************************************************************************************/
extern gapAdvertisingParameters_t   gAdvParams;
extern gapScanningParameters_t      gAppScanParams;
extern gapPairingParameters_t       gPairingParameters;
extern gapSmpKeys_t                 gSmpKeys;

deviceId_t   gPeerDeviceId = gInvalidDeviceId_c;
static char     mDeviceName[mMaxCharValueLength_d + 1]="";
/************************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
************************************************************************************/
int8_t ShellGap_Command(uint8_t argc, char * argv[])
{
    uint8_t i;
    
    if (argc < 2)
    {
        return CMD_RET_USAGE;
    }
    
    for (i=0; i< mShellGapCmdsCount_c; i++)
    {
        if(!strcmp((char*)argv[1], mGapShellCmds[i].name) )
        {
            return mGapShellCmds[i].cmd(argc-2, (char **)(&argv[2]));
        }
    }
    return CMD_RET_USAGE;
}
/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/

static int8_t ShellGap_DeviceAddress(uint8_t argc, char * argv[])
{
    switch(argc)
    {
        case 0:
        {
            Gap_ReadPublicDeviceAddress(); 
            return CMD_RET_ASYNC;
        }
        
        case 1:
        {
            
            return CMD_RET_SUCCESS;
        }
        default:
          return CMD_RET_USAGE;
    }
}

static int8_t ShellGap_DeviceName(uint8_t argc, char * argv[])
{
    uint16_t valueHandle = 0, serviceHandle = 0, length;
    uint8_t result;
    bleUuid_t   uuid;  
    
    
    uuid.uuid16 = gBleSig_GenericAccessProfile_d;
    GattDb_FindServiceHandle(1, gBleUuidType16_c, &uuid, &serviceHandle);
    
    uuid.uuid16 = gBleSig_GapDeviceName_d;
    GattDb_FindCharValueHandleInService(serviceHandle, gBleUuidType16_c,
                                        &uuid, &valueHandle);

    if (argc == 0)
    {
        result =  (uint8_t) (0xFF & GattDb_ReadAttribute(valueHandle, mMaxCharValueLength_d, (uint8_t*)mDeviceName, &length)); 
        
        if (result != gGattDbSuccess_c)
        {
            shell_write("\n\r-->  GATTDB Event: Procedure Error ");
            SHELL_NEWLINE();      
        }
        else
        {
            shell_write("\n\r-->  GATTDB Event: Attribute Read ");
            shell_write("\n\r     Value: ");
            shell_write(mDeviceName);   
            SHELL_NEWLINE();
        }
       
        return CMD_RET_SUCCESS;
    }   
    else
    {
        length = strlen(argv[0]);
        
        if (length > mMaxCharValueLength_d)
        {
            shell_write("\n\r-->  Variable length exceeds maximum!");
            return CMD_RET_FAILURE;
        }    

        result =  (uint8_t) (0xFF & GattDb_WriteAttribute(valueHandle, length, (uint8_t*)argv[0])); 

        if (result != gGattDbSuccess_c)
        {
            shell_write("\n\r-->  GATTDB Event: Procedure Error ");
            SHELL_NEWLINE();      
        }
        else
        {
            shell_write("\n\r-->  GATTDB Event: Attribute Written ");
            SHELL_NEWLINE();      
        }    
    }
    
    FLib_MemCpy(mDeviceName, argv[0], length);
    mDeviceName[length] = '>';
    mDeviceName[length+1] = 0;
    
    shell_change_prompt(mDeviceName);
    return CMD_RET_SUCCESS;
}

static int8_t ShellGap_StartAdvertising(uint8_t argc, char * argv[])
{
    if (argc != 0)
    {
        return CMD_RET_USAGE;
    }
    
    mIsMaster = FALSE;    
    App_StartAdvertising(ShellGap_AdvertisingCallback,
            ShellGap_ConnectionCallback);  
    
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_StopAdvertising(uint8_t argc, char * argv[])
{
    if (argc != 0)
    {
        return CMD_RET_USAGE;
    }
    
    Gap_StopAdvertising();
    
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_SetAdvertisingParameters(uint8_t argc, char * argv[])
{
    uint8_t i;
    bool_t bValidCmd = FALSE;
    
    if (argc == 0)
    {
        shell_write("\n\r-->  Advertising Parameters:");
        shell_write("\n\r    -->  Advertising Interval: ");
        shell_writeDec(gAdvParams.maxInterval * 625 / 1000);
        shell_write(" ms");
        shell_write("\n\r    -->  Advertising Type: ");
        
        switch(gAdvParams.advertisingType)
        {
            case gAdvConnectableUndirected_c:
            {
                shell_write("ADV_IND");
            }
            break;
            case gAdvDirectedHighDutyCycle_c:
            {
                shell_write("ADV_IND");
            }
            break;
            case gAdvNonConnectable_c:
            {
                shell_write("ADV_NONCON_IND");
            }
            break;
            case gAdvScannable_c:
            {
                shell_write("ADV_SCAN_IND");
            }
            break;
            case gAdvDirectedLowDutyCycle_c:
            {
                shell_write("ADV_DIRECT");
            }
            break;
            default:
            break;
        }
        SHELL_NEWLINE();
        return CMD_RET_SUCCESS;
    }
    
