Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/bluetooth/ble_shell/shell_gap.c
    for (i=0; i<argc; i+=2)
    {
        if(!strcmp((char*)argv[i], "-interval") && ((i+1) < argc))
        {
            uint16_t interval = atoi(argv[i+1])*1000/625;
            gAdvParams.maxInterval = interval;
            gAdvParams.minInterval = interval;
            bValidCmd = TRUE;
        }

        if(!strcmp((char*)argv[i], "-type") && ((i+1) < argc))
        {
            uint8_t advType = atoi(argv[i+1]);
            gAdvParams.advertisingType = (bleAdvertisingType_t)advType;
            bValidCmd = TRUE;
        }
    }
    
    if (bValidCmd)
    {
        Gap_SetAdvertisingParameters(&gAdvParams);
        return CMD_RET_ASYNC;
    }
    else
    {
        return CMD_RET_USAGE;
    }
}

static void ShellGap_AppendAdvData(gapAdvertisingData_t *pAdvData, gapAdType_t type, char * pData, bool_t fIsScanRsp)
{
    uint8_t i, advIdx = 0;
    uint8_t advCursor = 0; 
    uint8_t length;
    int32_t number;
    uint8_t *pAdvArrayData;
    
    pAdvArrayData = (fIsScanRsp) ? mpScanRspData : mpAdvData;
        
    if (pAdvArrayData == NULL)
    {
        /* No existing ADV data. Allocate memory */        
        pAdvArrayData = MEM_BufferAlloc(gcGapMaxAdvertisingDataLength_c);
        
        (fIsScanRsp)?(mpScanRspData = pAdvArrayData):(mpAdvData = pAdvArrayData);
        
    }
      
    for (advIdx=0; advIdx<pAdvData->cNumAdStructures; advIdx++)
    {
        if (pAdvData->aAdStructures[advIdx].adType == type)
        {
            return;
        }
        
        advCursor += pAdvData->aAdStructures[advIdx].length-1;
    }
    
    length = strlen(pData);
    
    /* Copy ADV payload*/
    pAdvData->aAdStructures[advIdx].aData = pAdvArrayData + advCursor;
    
    switch(type)
    {
        case gAdShortenedLocalName_c:
        case gAdCompleteLocalName_c:
        {   
            /* Check if we got space. Take into account length and type octets */
            if ((advCursor + length + 2 * (pAdvData->cNumAdStructures)) > gcGapMaxAdvertisingDataLength_c )
            {
                return;
            }
            
            FLib_MemCpy(pAdvArrayData + advCursor, pData, length);
        }
        break;
        
        default:
        {
            /* Halfen length because we print */
            length = (length % 2) ? (length/2) + 1 : (length/2);
            
            /* Check if we got space. Take into account length and type octets */
            if ((advCursor + length + 2 * (pAdvData->cNumAdStructures)) > gcGapMaxAdvertisingDataLength_c )
            {
                return;
            }
            
            for (i=0; i<strlen(pData); i+=4)
            {
                 number = strtoul(pData + i, NULL, 16);
                 FLib_MemCpy(pAdvArrayData + advCursor + i, &number, sizeof(uint32_t));
            }
        }
        break;
    }
    
    pAdvData->aAdStructures[advIdx].adType = type;
    pAdvData->aAdStructures[advIdx].length = length + 1;
    
    pAdvData->cNumAdStructures += 1;
}

static int8_t ShellGap_ChangeAdvertisingData(uint8_t argc, char * argv[])
{
    switch(argc)
    {
        case 0:
        {
            shell_write("\n\r\n\r-->  Advertising Data:");
            return CMD_RET_SUCCESS;
        }
        break;
        
        case 1:
        {
            if(!strcmp((char*)argv[0], "-clear"))
            {
                gAppAdvertisingData.cNumAdStructures = 0;
                if (mpAdvData)
                {
                    MEM_BufferFree(mpAdvData);
                }
                shell_write("\n\r\n\r-->  Advertising Data Erased.");
                return CMD_RET_SUCCESS;
            }            
        }
        break;
        
        default:
        {
            gapAdType_t advType = (gapAdType_t)atoi(argv[0]);
            ShellGap_AppendAdvData(&gAppAdvertisingData, advType, argv[1], FALSE);
            Gap_SetAdvertisingData(&gAppAdvertisingData, NULL);
            return CMD_RET_ASYNC;
        }
        break;      
    }
    
    return CMD_RET_USAGE;
}

static int8_t ShellGap_StartScanning(uint8_t argc, char * argv[])
{
    if (argc != 0)
    {
        return CMD_RET_USAGE;
    }
    
    mIsMaster = TRUE;    
    Gap_StartScanning(&gAppScanParams, ShellGap_ScanningCallback, TRUE);
    
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_StopScanning(uint8_t argc, char * argv[])
{
    if (argc != 0)
    {
        return CMD_RET_USAGE;
    }
    
    Gap_StopScanning();
    
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_SetScanParameters(uint8_t argc, char * argv[])
{
    uint8_t i;
    bool_t bValidCmd;
    
    if (argc == 0)
    {
        shell_write("\n\r-->  Scan Parameters:");
        shell_write("\n\r    -->  Scan Interval: ");
        shell_writeDec(gAppScanParams.interval * 625 / 1000);
        shell_write(" ms");
        shell_write("\n\r    -->  Scan Window: ");
        shell_writeDec(gAppScanParams.window * 625 / 1000);
        shell_write(" ms");
        shell_write("\n\r    -->  Scan Type: ");
        (gAppScanParams.type) ? shell_write("ACTIVE") : shell_write("PASSIVE");
        SHELL_NEWLINE();
        return CMD_RET_SUCCESS;
    }
    
    for (i=0; i<argc; i+=2)
    {
        if(!strcmp((char*)argv[i], "-interval") && ((i+1) < argc))
        {
            uint16_t interval = atoi(argv[i+1])*1000/625;
            gAppScanParams.interval = interval;
            gConnReqParams.scanInterval = interval;
            bValidCmd = TRUE;
        }

        if(!strcmp((char*)argv[i], "-window") && ((i+1) < argc))
        {
            uint16_t window = atoi(argv[i+1])*1000/625;
            gAppScanParams.window = window;
            gConnReqParams.scanWindow = window;
            bValidCmd = TRUE;
        }

        if(!strcmp((char*)argv[i], "-type") && ((i+1) < argc))
        {
            uint8_t scanType = atoi(argv[i+1]);
            gAppScanParams.type = (bleScanType_t)scanType;
            bValidCmd = TRUE;
        }
    }    
    
    if (bValidCmd)
    {   
        return CMD_RET_SUCCESS;
    }
    else
    {
        return CMD_RET_USAGE;
    }
}

static int8_t ShellGap_ChangeScanData(uint8_t argc, char * argv[])
{
    switch(argc)
    {
        case 0:
        {
            shell_write("\n\r\n\r-->  Scan Response Data:");
            return CMD_RET_SUCCESS;
        }
        break;
        
        case 1:
        {
            if(!strcmp((char*)argv[0], "-clear"))
            {
                gAppScanRspData.cNumAdStructures = 0;
                if (mpAdvData)
                {
                    MEM_BufferFree(mpAdvData);
                }
                shell_write("\n\r\n\r-->  Scan Response Erased.");
                return CMD_RET_SUCCESS;
            }            
        }
        break;
        
        default:
        {
            gapAdType_t advType = (gapAdType_t)atoi(argv[0]);
            ShellGap_AppendAdvData(&gAppScanRspData, advType, argv[1], TRUE);
            Gap_SetAdvertisingData(NULL, &gAppScanRspData);
            return CMD_RET_ASYNC;
        }
        break;      
    }
    
    return CMD_RET_USAGE;
}

static int8_t ShellGap_Connect(uint8_t argc, char * argv[])
{
    uint8_t deviceId;
    
