Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/bluetooth/ble_shell/shell_gap.c
    if (argc != 1)
    {
        return CMD_RET_USAGE;
    }
    
    deviceId = (uint8_t)atoi(argv[0]);
    
    if (deviceId > mScannedDevicesCount)
    {
        return CMD_RET_USAGE;
    }
    
    mConnectToDeviceId =  deviceId;
    mIsMaster = TRUE;
    
    gConnReqParams.scanInterval = gAppScanParams.interval;
    gConnReqParams.scanWindow = gAppScanParams.window;
    gConnReqParams.peerAddressType = mScannedDevices[deviceId].addrType;
    FLib_MemCpy(gConnReqParams.peerAddress, 
                mScannedDevices[deviceId].aAddress, 
                sizeof(bleDeviceAddress_t));
    
    /* Stop scanning if it's on*/
    if (mScanningOn)
    {
        Gap_StopScanning();
    }
    
    App_Connect(&gConnReqParams, ShellGap_ConnectionCallback);
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_SetConnectionParameters(uint8_t argc, char * argv[])
{
    uint8_t i;
    bool_t bValidCmd = FALSE;
    
    if (argc == 0)
    {
        bValidCmd = TRUE;
    }
    
    for (i=0; i<argc; i+=2)
    {
        if(!strcmp((char*)argv[i], "-interval") && ((i+1) < argc))
        {
            uint16_t interval = atoi(argv[i+1])*8/10;
            gConnReqParams.connIntervalMin = interval;
            gConnReqParams.connIntervalMax = interval;
            bValidCmd = TRUE;
        }

        if(!strcmp((char*)argv[i], "-latency") && ((i+1) < argc))
        {
            uint16_t latency = atoi(argv[i+1]);
            gConnReqParams.connLatency = latency;
            bValidCmd = TRUE;
        }

        if(!strcmp((char*)argv[i], "-timeout") && ((i+1) < argc))
        {
            uint16_t timeout = atoi(argv[i+1])/10;
            gConnReqParams.supervisionTimeout = timeout;
            bValidCmd = TRUE;
        }
    }    
    
    if (bValidCmd)
    {   
        shell_write("\n\r-->  Connection Parameters:");
        shell_write("\n\r    -->  Connection Interval: ");
        shell_writeDec(gConnReqParams.connIntervalMax * 10 / 8);
        shell_write(" ms");
        
        shell_write("\n\r    -->  Connection Latency: ");
        shell_writeDec(gConnReqParams.connLatency);

        shell_write("\n\r    -->  Supervision Timeout: ");
        shell_writeDec(gConnReqParams.supervisionTimeout * 10);
        shell_write(" ms\n\r");

        SHELL_NEWLINE();
        return CMD_RET_SUCCESS;
    }
    else
    {
        return CMD_RET_USAGE;
    }
}

static int8_t ShellGap_Disconnect(uint8_t argc, char * argv[])
{
    if (argc != 0)
    {
        return CMD_RET_USAGE;
    }

    Gap_Disconnect(gPeerDeviceId);
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_UpdateConnection(uint8_t argc, char * argv[])
{
    uint16_t minInterval, maxInterval, latency, timeout;
    
    if (argc != 4)
    {
        return CMD_RET_USAGE;
    }
            
    minInterval = atoi(argv[0])*8/10;
    maxInterval = atoi(argv[1])*8/10;
    latency = atoi(argv[2]);
    timeout = atoi(argv[3])/10;

    Gap_UpdateConnectionParameters(gPeerDeviceId, minInterval, maxInterval, latency, timeout,
                                    gGapConnEventLengthMin_d, gGapConnEventLengthMax_d);
    
    return CMD_RET_SUCCESS;
}

static int8_t ShellGap_Pair(uint8_t argc, char * argv[])
{
    if (argc != 0)
    {
        return CMD_RET_USAGE;
    }
        
    if (gPeerDeviceId == gInvalidDeviceId_c)
    {
        shell_write("\n\r-->  Please connect the node first...");
        return CMD_RET_FAILURE;
    }    
    
    shell_write("\n\r-->  Pairing...\n\r");

    if (mIsMaster)
    {
        Gap_Pair(gPeerDeviceId, &gPairingParameters);
    }
    else
    {
    
        Gap_SendSlaveSecurityRequest(gPeerDeviceId, 
                                 gPairingParameters.withBonding,
                                 gPairingParameters.securityModeAndLevel);
    }
    
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_PairCfg(uint8_t argc, char * argv[])
{
    uint8_t i;
    bool_t bValidCmd = FALSE;
    
    if (argc == 0)
    {
        bValidCmd = TRUE;
    }
    
    for (i=0; i<argc; i+=2)
    {
        if(!strcmp((char*)argv[i], "-usebonding") && ((i+1) < argc))
        {
            uint8_t usebonding = atoi(argv[i+1]);
            gPairingParameters.withBonding = usebonding?TRUE:FALSE;
            bValidCmd = TRUE;
        }

        if(!strcmp((char*)argv[i], "-seclevel") && ((i+1) < argc))
        {
            uint8_t level = strtoul(argv[i+1], NULL, 16);
            if ((level & 0x0F) <= gSecurityLevel_WithMitmProtection_c &&
                (level & 0xF0) <= gSecurityMode_2_c)
            {
                gPairingParameters.securityModeAndLevel = (gapSecurityModeAndLevel_t)level;
                bValidCmd = TRUE;
            }
        }

        if(!strcmp((char*)argv[i], "-keyflags") && ((i+1) < argc))
        {
            uint8_t flags = strtoul(argv[i+1], NULL, 16);
            gPairingParameters.centralKeys = (gapSmpKeyFlags_t)(flags & 0x07);
            gPairingParameters.peripheralKeys = (gapSmpKeyFlags_t)(flags & 0x07);
            bValidCmd = TRUE;
        }
    }    
    
    if (bValidCmd)
    {   
        shell_write("\n\r-->  Pairing Configuration:");
        shell_write("\n\r    -->  Use Bonding: ");
        shell_writeBool(gPairingParameters.withBonding);
        
        shell_write("\n\r    -->  SecurityLevel: ");
        shell_writeHex((uint8_t*)&gPairingParameters.securityModeAndLevel, 1);

        shell_write("\n\r    -->  Flags: ");
        shell_writeHex((uint8_t*)&gPairingParameters.centralKeys, 1);

        SHELL_NEWLINE();
        return CMD_RET_SUCCESS;
    }
    else
    {
        return CMD_RET_USAGE;
    }
}

static int8_t ShellGap_EnterPasskey(uint8_t argc, char * argv[])
{   
    uint32_t passKey;
      
    if (argc != 1)
    {
        return CMD_RET_USAGE;
    }

    passKey = atoi(argv[0]);
    
    Gap_EnterPasskey(gPeerDeviceId, passKey);
    return CMD_RET_ASYNC;
}

static int8_t ShellGap_Bonds(uint8_t argc, char * argv[])
{
    uint8_t i = 0, count = 0;

    switch(argc)
    {
        case 0:
        {
            /* Get number of bonded devices */
            Gap_GetBondedDevicesCount(&count);
            
