Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/bluetooth/ble_shell/shell_gap.c
            if (!count)
            {
                shell_write("\n\r-->  No bonds found on the device! \n\r");
                return CMD_RET_SUCCESS;
            }
            else
            {
                void* pBuffer = NULL;
                
                /* Allocate buffer for name */
                pBuffer = MEM_BufferAlloc(mShellGapMaxDeviceNameLength_c);
                
                if (!pBuffer)
                {
                    return CMD_RET_FAILURE;
                }
                
                for (i=0; i<count;i++)
                {
                    shell_write("\n\r-->  ");                    
                    shell_writeDec(i);
                    shell_write(". ");
                    Gap_GetBondedDeviceName(i, pBuffer, mShellGapMaxDeviceNameLength_c);
                    
                    if (strlen(pBuffer) > 0)
                    {
                        shell_write(pBuffer);
                    }
                    else
                    {
                        shell_write("[No saved name]");
                    }
                }
                SHELL_NEWLINE();
                return CMD_RET_SUCCESS;
            }
        }
        break;
        
        case 1:
        {
            if(!strcmp((char*)argv[0], "-erase"))
            {              
                if (gPeerDeviceId != gInvalidDeviceId_c)
                {
                    shell_write("\n\r-->  Please disconnect the node first...");
                    return CMD_RET_FAILURE;
                }
                
                if (Gap_RemoveAllBonds() == gBleSuccess_c)
                {
                    shell_write("\n\r-->  Bonds removed!\n\r");
                    return CMD_RET_SUCCESS;
                }
                else
                {
                    shell_write("\n\r-->  Operation failed!\n\r");
                    return CMD_RET_FAILURE;
                }
            }            
        }
        break;
        
        case 2:
        {
            if(!strcmp((char*)argv[0], "-remove"))
            {
                uint8_t index = atoi(argv[1]);
                
                if (gPeerDeviceId != gInvalidDeviceId_c)
                {
                    shell_write("\n\r-->  Please disconnect the node first...\n\r");
                    return CMD_RET_FAILURE;
                }
                
                /* Get number of bonded devices */
                Gap_GetBondedDevicesCount(&count);
                
                if ((count > 0) && (index < count) &&
                    (Gap_RemoveBond(index) == gBleSuccess_c))
                {
                    shell_write("\n\r-->  Bond removed!\n\r");
                    return CMD_RET_SUCCESS;                  
                }
                else
                {
                    shell_write("\n\r-->  Operation failed!\n\r");
                    return CMD_RET_FAILURE;               
                }
            }            
        }
        break;
        
        default:
            break;      
    }
    
    return CMD_RET_USAGE;
}

static void ShellGap_ParseScannedDevice(gapScannedDevice_t* pData)
{
    uint8_t index = 0;
    uint8_t nameLength;
    
    while (index < pData->dataLength)
    {
        gapAdStructure_t adElement;
        
        adElement.length = pData->data[index];
        adElement.adType = (gapAdType_t)pData->data[index + 1];
        adElement.aData = &pData->data[index + 2];
        
        if ((adElement.adType == gAdShortenedLocalName_c) ||
          (adElement.adType == gAdCompleteLocalName_c))
        {
            nameLength = MIN(adElement.length-1, mShellGapMaxDeviceNameLength_c);
            FLib_MemCpy(mScannedDevices[mScannedDevicesCount].name, adElement.aData, nameLength);
            
            shell_write((char*)mScannedDevices[mScannedDevicesCount].name);
            shell_write(" "); 
        }
        
        /* Move on to the next AD elemnt type */
        index += adElement.length + sizeof(uint8_t);
    }

    shell_writeHexLe(pData->aAddress, sizeof(bleDeviceAddress_t));
    shell_write(" ");   
    
    /* Temporary store scanned data to use for connection */
    mScannedDevices[mScannedDevicesCount].addrType = pData->addressType;
    FLib_MemCpy(mScannedDevices[mScannedDevicesCount].aAddress, 
                pData->aAddress, 
                sizeof(bleDeviceAddress_t));
    
    shell_writeSignedDec(pData->rssi);
    shell_write(" dBm");

    mScannedDevicesCount++;
}

/*! *********************************************************************************
 * \brief        Handles BLE generic callback.
 *
 * \param[in]    pGenericEvent    Pointer to gapGenericEvent_t.
 ********************************************************************************** */
void ShellGap_GenericCallback (gapGenericEvent_t* pGenericEvent)
{
    shell_write("\n\r-->  GAP Event: ");
    
    switch(pGenericEvent->eventType)
    {
        case gPublicAddressRead_c:
        {
            shell_write("Public Address Read:");
            shell_writeHex(pGenericEvent->eventData.aAddress, sizeof(bleDeviceAddress_t));
            break;
        }

        case gAdvertisingDataSetupComplete_c:
        {
            shell_write("Advertising data successfully set.");
            break;
        }
        
        case gAdvertisingParametersSetupComplete_c:
        {
            shell_write("Advertising parameters successfully set.");
            break;
        }

        case gAdvertisingSetupFailed_c:
        {
            shell_write("Advertising setup failed.");
            break;
        }

        case gInternalError_c:
        {
          
        }
        break;

        default:
            break;
    }
    SHELL_NEWLINE();
    shell_cmd_finished();
}

/*! *********************************************************************************
 * \brief        Handles BLE Advertising callback from host stack.
 *
 * \param[in]    pAdvertisingEvent    Pointer to gapAdvertisingEvent_t.
 ********************************************************************************** */
static void ShellGap_AdvertisingCallback
(
    gapAdvertisingEvent_t* pAdvertisingEvent
)
{
    shell_write("\n\r-->  GAP Event: Advertising ");
                
    switch (pAdvertisingEvent->eventType)
    {
        case gAdvertisingStateChanged_c:
        {
            mAdvOn = !mAdvOn;
    
            if (mAdvOn)
            {
                shell_write("started.\n\r");
            }
            else
            {
                shell_write("stopped.\n\r");
            }
            break;
        }

