Masmiseim36/nxpSDK/boards/usbkw41z_kw41z/wireless_examples/bluetooth/ble_shell/shell_gap.c
        case gAdvertisingCommandFailed_c:
        {
            shell_write("state could not be changed.\n\r");
            break;
        }

    default:
        break;
    }
    
    shell_cmd_finished();
}

/*! *********************************************************************************
 * \brief        Handles BLE Connection callback from host stack.
 *
 * \param[in]    peerDeviceId        Peer device ID.
 * \param[in]    pConnectionEvent    Pointer to gapConnectionEvent_t.
 ********************************************************************************** */
static void ShellGap_ConnectionCallback
(
    deviceId_t peerDeviceId,
    gapConnectionEvent_t* pConnectionEvent
)
{
    switch (pConnectionEvent->eventType)
    {
        case gConnEvtConnected_c:
        {
            gPeerDeviceId = peerDeviceId;
            shell_write("\n\r-->  GAP Event: Connected\n\r");
            shell_cmd_finished();  
            
            mAdvOn = FALSE;
            mIsBonded = FALSE;
            
            Gap_CheckIfBonded(peerDeviceId, &mIsBonded);
            
            if ((mIsBonded) &&
            (gBleSuccess_c == Gap_LoadCustomPeerInformation(peerDeviceId, NULL, 0 ,0)))
            {              
                /* Restored custom connection information. Encrypt link */
                Gap_EncryptLink(peerDeviceId);
            }
            
            /* Save connection parameters */
            FLib_MemCpy(&mConnectionParams,
                        &pConnectionEvent->eventData.connectedEvent.connParameters,
                        sizeof(gapConnectionParameters_t));
        }
        break;
        
        case gConnEvtDisconnected_c:
        {
            gPeerDeviceId = gInvalidDeviceId_c;
            shell_write("\n\r-->  GAP Event: Disconnected\n\r");
            shell_cmd_finished();
        }
        break;    
        
        case gConnEvtPairingRequest_c:
        {
            Gap_AcceptPairingRequest(peerDeviceId, &gPairingParameters);
        }
        break;

        case gConnEvtKeyExchangeRequest_c:
        {
            gapSmpKeys_t sentSmpKeys = gSmpKeys;
            
            if (!(pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys & gLtk_c))
            {
                sentSmpKeys.aLtk = NULL;
                /* When the LTK is NULL EDIV and Rand are not sent and will be ignored. */
            }
            
            if (!(pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys & gIrk_c))
            {
                sentSmpKeys.aIrk = NULL;
                /* When the IRK is NULL the Address and Address Type are not sent and will be ignored. */
            }
            
            if (!(pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys & gCsrk_c))
            {
                sentSmpKeys.aCsrk = NULL;
            }
            
            Gap_SendSmpKeys(peerDeviceId, &sentSmpKeys);
        }
        break;
        
        case gConnEvtPasskeyRequest_c:
        {
            shell_write("\n\r\n\r-->  GAP Event: PIN required\n\r");
            shell_cmd_finished();
        }
        break;
        
        case gConnEvtPasskeyDisplay_c:
        {
            shell_write("\n\r-->  GAP Event: Passkey is ");
            shell_writeDec(pConnectionEvent->eventData.passkeyForDisplay);
            SHELL_NEWLINE();
            shell_cmd_finished();
        }
        break;
        
        case gConnEvtLongTermKeyRequest_c:
        {
            if (pConnectionEvent->eventData.longTermKeyRequestEvent.ediv == gSmpKeys.ediv &&
                pConnectionEvent->eventData.longTermKeyRequestEvent.randSize == gSmpKeys.cRandSize)
            {
                Gap_LoadEncryptionInformation(peerDeviceId, gSmpKeys.aLtk, &gSmpKeys.cLtkSize);
                /* EDIV and RAND both matched */
                Gap_ProvideLongTermKey(peerDeviceId, gSmpKeys.aLtk, gSmpKeys.cLtkSize);
            }
            else
            /* EDIV or RAND size did not match */
            {
                Gap_DenyLongTermKey(peerDeviceId);
            }
            break;
        }
       
        case gConnEvtPairingComplete_c:
        {
            if (pConnectionEvent->eventData.pairingCompleteEvent.pairingSuccessful)
            {
                shell_write("\n\r-->  GAP Event: Device Paired.\n\r");
                
                /* Save Device Name in NVM*/
                Gap_SaveDeviceName(peerDeviceId, mScannedDevices[mConnectToDeviceId].name, strlen((char*)mScannedDevices[mConnectToDeviceId].name));
            }
            else
            {
                shell_write("\n\r-->  GAP Event: Pairing Unsuccessful.\n\r");
            }
            shell_cmd_finished();
        }
        break;
        
        case gConnEvtLeScDisplayNumericValue_c:
        {
            (void) pConnectionEvent->eventData.numericValueForDisplay;
            /* Display on a screen for user confirmation then validate/invalidate based on value. */
            Gap_LeScValidateNumericValue(peerDeviceId, TRUE);
        }
        break;
        
        case gConnEvtEncryptionChanged_c:
        {
            if (pConnectionEvent->eventData.encryptionChangedEvent.newEncryptionState)
            {
                shell_write("\n\r-->  GAP Event: Link Encrypted.\n\r");
            }
            else
            {
                shell_write("\n\r-->  GAP Event: Link Not Encrypted.\n\r");
            }
            shell_cmd_finished();
        }
        break;
        
        case gConnEvtParameterUpdateRequest_c:
        {
            Gap_EnableUpdateConnectionParameters(peerDeviceId, TRUE);
        }   
        break;
        
        case gConnEvtParameterUpdateComplete_c:
        {
            if (pConnectionEvent->eventData.connectionUpdateComplete.status == gBleSuccess_c)
            {
                mConnectionParams.connInterval = pConnectionEvent->eventData.connectionUpdateComplete.connInterval;
                mConnectionParams.connLatency = pConnectionEvent->eventData.connectionUpdateComplete.connLatency;
                mConnectionParams.supervisionTimeout = pConnectionEvent->eventData.connectionUpdateComplete.supervisionTimeout;
                
                shell_write("\n\r-->  GAP Event: Connection Parameters Changed.");
                shell_write("\n\r   -->Connection Interval: ");
                shell_writeDec(mConnectionParams.connInterval * 10/8);
                shell_write(" ms");
                shell_write("\n\r   -->Connection Latency: ");
                shell_writeDec(mConnectionParams.connLatency);
                shell_write("\n\r   -->Supervision Timeout: ");
                shell_writeDec(mConnectionParams.supervisionTimeout * 10);
                shell_write(" ms");                
                shell_cmd_finished();
            }
            else
            {
                shell_write("\n\r-->  GAP Event: Connection Parameters Did Not Change.");
            }
        }
        break;
        
        default:
        break;
    }
}

/*! *********************************************************************************
 * \brief        Handles BLE Scanning callback from host stack.
 *
 * \param[in]    pScanningEvent    Pointer to gapScanningEvent_t.
 ********************************************************************************** */
static void ShellGap_ScanningCallback (gapScanningEvent_t* pScanningEvent)
{
    switch (pScanningEvent->eventType)
    {
        case gDeviceScanned_c:
        {
            if (mScannedDevicesCount >= mShellGapMaxScannedDevicesCount_c)
            {
                break;
            }
            
            shell_write("\n\r-->  GAP Event: Found device ");
            shell_writeDec(mScannedDevicesCount);
            shell_write(" : ");            
            ShellGap_ParseScannedDevice(&pScanningEvent->eventData.scannedDevice);              
            break;
        }

        case gScanStateChanged_c:
        {
            mScanningOn = !mScanningOn;
            
            shell_write("\n\r->  GAP Event: Scan ");
            if (mScanningOn)
            {
                mScannedDevicesCount = 0; 
                shell_write("started.\n\r");
            }
            else
            {
                shell_write("stopped.\n\r");
            }
            shell_cmd_finished();
            break;
        }

    case gScanCommandFailed_c:
    {
        shell_write("\n\r-->  GAP Event: Scan state could not be changed.");
        shell_cmd_finished();
        break;
    }
    default:
        break;
    }
}

void ShellGap_L2caControlCallback
(
    l2capControlMessageType_t  messageType,
    void* pMessage
)
{
    switch (messageType)
    {

        
    default:
      break;
    }
}

/*! *********************************************************************************
 * @}
 ********************************************************************************** */
